RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/inc/hc32f460_sdioc.h
    uint16_t                 u16BlkCnt;             ///< Block count

    en_functional_state_t    enAutoCmd12Enable;     ///< Enable: Auto CMD12 enable, Disable: Auto CMD12 disable

    en_sdioc_transfer_dir_t  enTransferDir;         ///< Specifies the data transfer direction of the SDIOC controller.
                                                    ///< This parameter can be a value of @ref en_sdioc_transfer_dir_t.

    en_sdioc_data_timeout_t  enDataTimeOut;         ///< Specifies the data timeout period in card bus clock periods.
                                                    ///< This parameter can be a value of @ref en_sdioc_data_timeout_t.

    en_sdioc_transfer_mode_t enTransferMode;        ///< Specifies the data transfer mode of the SDIOC controller.
                                                    ///< This parameter can be a value of @ref en_sdioc_transfer_mode_t.
} stc_sdioc_data_cfg_t;

/**
 *******************************************************************************
 ** \brief SDIOC normal interrupt enable structure
 **
 ******************************************************************************/
typedef struct stc_sdioc_normal_irq_en
{
    union
    {
        uint16_t                     u16NormalIntsgEn;  ///< SDIOC normal interrupt enable
        stc_sdioc_errintsgen_field_t stcNormalIntsgEn;  ///< SDIOC normal interrupt enable bit-field structure
    };
} stc_sdioc_normal_irq_en_t;

/**
 *******************************************************************************
 ** \brief SDIOC normal interrupt enable structure
 **
 ******************************************************************************/
typedef struct stc_sdioc_error_irq_en
{
    union
    {
        uint16_t                     u16ErrorIntsgEn;   ///< SDIOC error interrupt enable
        stc_sdioc_errintsgen_field_t stcErrorIntsgEn;   ///< SDIOC error interrupt enable bit-field structure
    };
} stc_sdioc_error_irq_en_t;

/**
 *******************************************************************************
 ** \brief SDIOC error status callback functions
 **
 ******************************************************************************/
typedef struct stc_sdioc_normal_irq_cb
{
    func_ptr_t pfnCommandCompleteIrqCb;     ///< Pointer to command complete callback function

    func_ptr_t pfnTransferCompleteIrqCb;    ///< Pointer to transfer complete callback function

    func_ptr_t pfnBlockGapIrqCb;            ///< Pointer to Block gap callback function

    func_ptr_t pfnBufferWriteReadyIrqCb;    ///< Pointer to buffer write ready callback function

    func_ptr_t pfnBufferReadReadyIrqCb;     ///< Pointer to buffer read ready callback function

    func_ptr_t pfnCardInsertIrqCb;          ///< Pointer to card insertion callback function

    func_ptr_t pfnCardRemovalIrqCb;         ///< Pointer to card removal callback function

    func_ptr_t pfnCardIrqCb;                ///< Pointer to card interrupt callback function
} stc_sdioc_normal_irq_cb_t;

/**
 *******************************************************************************
 ** \brief SDIOC error status callback functions
 **
 ******************************************************************************/
typedef struct stc_sdioc_error_irq_cb
{
    func_ptr_t pfnCmdTimeoutErrIrqCb;       ///< Pointer to command timeout error interrupt callback function

    func_ptr_t pfnCmdCrcErrIrqCb;           ///< Pointer to command CRC error interrupt callback function

    func_ptr_t pfnCmdEndBitErrIrqCb;        ///< Pointer to command end bit error interrupt callback function

    func_ptr_t pfnCmdIndexErrIrqCb;         ///< Pointer to command index error interrupt callback function

    func_ptr_t pfnDataTimeoutErrIrqCb;      ///< Pointer to data timeout error interrupt callback function

    func_ptr_t pfnDataCrcErrIrqCb;          ///< Pointer to data CRC error interrupt callback function

    func_ptr_t pfnDataEndBitErrIrqCb;       ///< Pointer to data end bit error interrupt callback function

    func_ptr_t pfnAutoCmdErrIrqCb;          ///< Pointer to command error interrupt callback function
} stc_sdioc_error_irq_cb_t;

/**
 *******************************************************************************
 ** \brief SDIOC initialization configuration
 **
 ******************************************************************************/
typedef struct stc_sdioc_init
{
    stc_sdioc_normal_irq_en_t *pstcNormalIrqEn;     ///< Pointer to normal interrupt enable structure

    stc_sdioc_normal_irq_cb_t *pstcNormalIrqCb;     ///< Pointer to normal interrupt callback function structure

    stc_sdioc_error_irq_en_t  *pstcErrorIrqEn;      ///< Pointer to error interrupt enable structure

    stc_sdioc_error_irq_cb_t  *pstcErrorIrqCb;      ///< Pointer to error interrupt callback structure
} stc_sdioc_init_t;

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
 * Global function prototypes (definition in C source)
 ******************************************************************************/
void SDIOC_IrqHandler(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_Init(M4_SDIOC_TypeDef *SDIOCx,
                                const stc_sdioc_init_t *pstcInitCfg);
en_result_t SDIOC_DeInit(M4_SDIOC_TypeDef *SDIOCx);
void SDIOC_SetMode(const M4_SDIOC_TypeDef *SDIOCx, en_sdioc_mode_t enMode);
en_result_t SDIOC_SendCommand(M4_SDIOC_TypeDef *SDIOCx,
                                const stc_sdioc_cmd_cfg_t *pstcCmdCfg);
uint32_t SDIOC_GetResponse(const M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_response_reg_t enRespReg);
en_result_t SDIOC_ReadBuffer(M4_SDIOC_TypeDef *SDIOCx,
                                uint8_t au8Data[],
                                uint32_t u32Len);
en_result_t SDIOC_WriteBuffer(M4_SDIOC_TypeDef *SDIOCx,
                                uint8_t au8Data[],
                                uint32_t u32Len);
en_result_t SDIOC_ConfigData(M4_SDIOC_TypeDef *SDIOCx,
                                const stc_sdioc_data_cfg_t *pstcDataCfg);
en_result_t SDIOC_SdclkCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_functional_state_t enCmd);
en_result_t SDIOC_SetClkDiv(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_clk_div_t enClkDiv);
en_sdioc_clk_div_t SDIOC_GetClkDiv(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_SetClk(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32ClkFreq);
en_result_t SDIOC_SetBusWidth(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_bus_width_t enBusWidth);
en_sdioc_bus_width_t SDIOC_GetBusWidth(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_SetSpeedMode(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_speed_mode_t enSpeedMode);
en_sdioc_speed_mode_t SDIOC_GetSpeedMode(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_SetDataTimeout(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_data_timeout_t enTimeout);
en_sdioc_data_timeout_t SDIOC_GetDataTimeout(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_SetCardDetectSignal(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_detect_signal_t enDetectSignal);
en_flag_status_t SDIOC_GetCardDetectTestLevel(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_BusPowerOn(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_BusPowerOff(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_StopAtBlockGapCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_functional_state_t enCmd);
en_result_t SDIOC_RestartTransfer(M4_SDIOC_TypeDef *SDIOCx);
en_result_t SDIOC_ReadWaitCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_functional_state_t enCmd);
en_result_t SDIOC_InterruptAtBlockGapCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_functional_state_t enCmd);
en_result_t SDIOC_SoftwareReset(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_sw_reset_t enSwResetType);
en_flag_status_t SDIOC_GetStatus(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_host_status_t enHostStatus);
en_result_t SDIOC_NormalIrqSignalCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_nor_int_sel_t enNorInt,
                                en_functional_state_t enCmd);
en_result_t SDIOC_NormalIrqStatusCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_nor_int_sel_t enNorInt,
                                en_functional_state_t enCmd);
en_flag_status_t SDIOC_GetNormalIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_nor_int_flag_t enNorInt);
en_result_t SDIOC_ClearNormalIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_nor_int_flag_t enNorInt);
en_result_t SDIOC_ErrIrqSignalCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_err_int_sel_t enErrInt,
                                en_functional_state_t enCmd);
en_result_t SDIOC_ErrIrqStatusCmd(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_err_int_sel_t enErrInt,
                                en_functional_state_t enCmd);
en_flag_status_t SDIOC_GetErrIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_err_int_flag_t enErrInt);
en_result_t SDIOC_ClearErrIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_err_int_flag_t enErrInt);
en_result_t SDIOC_ForceErrIrqFlag(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_err_int_sel_t enErrInt);
en_flag_status_t SDIOC_GetAutoCmdErrStatus(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_atuo_cmd_err_status_t enAutoCmdErr);
en_result_t SDIOC_ForceAutoCmdErr(M4_SDIOC_TypeDef *SDIOCx,
                                en_sdioc_atuo_cmd_err_sel_t enAutoCmdErr);

//@} // SdiocGroup

#ifdef __cplusplus
}
#endif

#endif /* DDL_SDIOC_ENABLE */

#endif /* __HC32F460_SDIOC_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
